

#include "Headerrrr.h"


int main()
{
	system("title Программа продажи путёвок");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	setlocale(LC_ALL, "Rus");
	system("mode con cols=80 lines=30");

	Decoration d;
	d.hello();

	d.setCursorPosition(0, 19);
	cout << "	   Нажмите клавишу F1, чтобы открыть инструкцию;" << endl;
	cout << "	   Нажмите клавишу F2, чтобы открыть информацию об авторе;" << endl;
	cout << "	   или нажмите любую другую клавишу, чтобы начать поиск . . .";
	int c;
	while (true) {
		c = _getch();
		if (c == 0) {
			c = _getch();
			if (c == 59) {
				system("Инструкция.txt");
			}
			else if (c == 60) {
				system("Автор.txt");
			}
		}
		else break;
	}

	system("cls");
	Vacation a[16];
	a[0] = { "Европа", "Германия", "Экскурсия", "3", "15", "14" };
	a[1] = { "Европа", "Англия", "Экскурсия", "4", "25", "10" };
	a[2] = { "Европа", "Шотландия", "Экскурсия", "2", "10", "14" };
	a[3] = { "Европа", "Финляндия", "Горнолыжный курорт", "5", "30", "10" };
	a[4] = { "Европа", "Швейцария", "Горнолыжный курорт", "5", "30", "14" };
	a[5] = { "Европа", "Норвегия", "Горнолыжный курорт", "4", "25", "14" };
	a[6] = { "Азия", "Бали", "Море", "3", "10", "14" };
	a[7] = { "Азия", "Шри-Ланка", "Море", "5", "20", "10" };
	a[8] = { "Азия", "Таиланд", "Море", "4", "20", "14" };
	a[9] = { "Азия", "Китай", "Экскурсия", "4", "25", "14" };
	a[10] = { "Европа", "Италия", "Море", "5", "20", "14" };
	a[11] = { "Европа", "Италия", "Экскурсия", "3", "25", "10" };
	a[12] = { "Европа", "Греция", "Море", "4", "10", "14" };
	a[13] = { "Европа","Греция", "Экскурсия", "3", "20", "10" };
	a[14] = { "Европа", "Испания", "Море", "5", "20", "14" };
	a[15] = { "Европа", "Испания", "Экскурсия", "4", "25", "10" };

	Vacation b[2];
	b[0] = { "Азия","Египет","Море","3","10","14" };
	b[1] = { "Азия","Турция","Море","4","12","14" };

	vector <Vacation> res;
	while (true) {
		res = poisk(a, b);
		cout << endl << "Желаете поискать еще?(1/0)";
		int ans;
		cin >> ans;
		if (ans == 0) break;
		string s1; //очищаем последующие поиски от ентера, чтобы часть света не скипалась
		getline(cin, s1);
		system("cls");
	}


	cout << "Пожалуйста, введите номер более подходящей вам путевки." << endl;//вот тут пользователь
	//должен выбрать 1 путевку по которой потом считается скидка Skidka() если он постоянный пользователь
	int num = 0;
	cin >> num;
	Vacation result;
	result = res[num - 1];
	system("cls");
	cout << "Вы постоянный клиент? (1 - да, 0 - нет)";
	int post;
	cin >> post;

	switch (post) {
	case 1:
		cout << "Ваш выбор:" << endl;
		result.returnnn();
		cout << endl << "Стоимость Вашей поездки с учетом 10% скидки будет = " << result.Skidka() << "$" << endl << endl;
		break;
	case  0:
		cout << "Ваш выбор:" << endl;
		result.returnnn();
		cout << endl << "Оформите карту постоянного клиента для получения скидок и бонусов!" << endl << endl;
		cout << "Стоимость поездки составит " << stoi(result.days) * stoi(result.payment) << "$" << endl;
		break;
	}
	Airplanes airplane;
	string name, number;

	name = "Boeing 777";
	srand(time(NULL));
	int n = rand();
	number = to_string(n);

	airplane.set_airplane_number(number);

	cout << "Модель Вашего самолета: " << airplane.get_airplane_name(name) << endl;
	cout << "И его номер: " << " " << airplane.get_airplane_number(number);

	cout << endl << "Спасибо за использование программы!" << endl;
	cout << "Для выхода нажмите любую клавишу...";
	int g;
	g = _getch();
	return 0;
}